TA222301017/DualCore_BLE_SD_PSOC6/proj_cm0p/Local/BLETask.h
/*
 * BLETask.h
 *
 *  Created on: Feb 28, 2023
 *      Author: sidar
 */

#ifndef BLETASK_H_
#define BLETASK_H_

#include "cybsp.h"
#include "cyhal.h"
#include "cy_retarget_io.h"

/* Library for malloc and free */
#include "stdlib.h"

/* FreeRTOS */
#include <FreeRTOS.h>
#include <task.h>
#include <queue.h>

/* btstack */
#include "wiced_bt_stack.h"

/* App utilities */
#include "app_bt_utils.h"

/* Include header files from BT configurator */
#include "cycfg_bt_settings.h"
#include "cycfg_gap.h"

/*******************************************************************
 * Macros to assist development of the exercises
 ******************************************************************/
#ifndef CYBSP_USER_LED2
#define CYBSP_USER_LED2 P10_0
#endif

#define UART_INPUT true

#define TASK_STACK_SIZE (4096u)
#define TASK_PRIORITY (5u)

/* Typdef for function used to free allocated buffer to stack */
typedef void (*pfn_free_buffer_t)(uint8_t *);

/* These are the UUIDs used in the peripheral. They are copied from the peripheral cycfg_gatt_db.h file */
#define __UUID_SERVICE_PSOC 0x90, 0x86, 0x13, 0xFE, 0x44, 0x99, 0x07, 0x93, 0x67, 0x4B, 0x3F, 0x63, 0xFF, 0x8A, 0x9E, 0x9D
#define __UUID_CHARACTERISTIC_PSOC_LED 0xCD, 0x5B, 0xA7, 0xEB, 0x47, 0x68, 0x4C, 0x9E, 0xAB, 0x4C, 0x8B, 0xBA, 0xDA, 0xBD, 0x8A, 0x26
#define __UUID_CHARACTERISTIC_PSOC_BUTTON_COUNT 0xA6, 0xDB, 0x81, 0x59, 0x4D, 0x4F, 0x1E, 0x8B, 0x20, 0x4B, 0x4E, 0x6E, 0x83, 0xA0, 0x07, 0xFB
#define __UUID_DESCRIPTOR_CLIENT_CHARACTERISTIC_CONFIGURATION 0x2902

/*******************************************************************
 * Function Prototypes
 ******************************************************************/
/* Callback function for Bluetooth stack management type events */
static wiced_bt_dev_status_t app_bt_management_callback(wiced_bt_management_evt_t event, wiced_bt_management_evt_data_t *p_event_data);

/* GATT Event Callback and Handler Functions */
static wiced_bt_gatt_status_t app_bt_gatt_event_callback(wiced_bt_gatt_evt_t event, wiced_bt_gatt_event_data_t *p_event_data);

static wiced_bt_gatt_status_t app_bt_connect_event_handler(wiced_bt_gatt_connection_status_t *p_conn_status);

/* Declaration for scan callback function */
void scanCallback(wiced_bt_ble_scan_results_t *p_scan_result, uint8_t *p_adv_data);

/* Function to write to an attribute */
void writeAttribute(uint16_t conn_id, uint16_t handle, uint16_t offset, wiced_bt_gatt_auth_req_t auth_req, uint16_t len, uint8_t *val);

/* Service discovery functions */
static void startServiceDiscovery(void);
static void startCharacteristicDiscovery(void);
static void startDescriptorDiscovery(void);

#if (UART_INPUT == true)
/* Tasks to handle UART */
static void rx_cback(void *handler_arg, cyhal_uart_event_t event); /* Callback for data received from UART */
static void uart_task(void *pvParameters);
#endif

/* Helper functions to allocate/free buffers for GATT operations */
static uint8_t *app_bt_alloc_buffer(uint16_t len);
static void app_bt_free_buffer(uint8_t *p_data);

/*******************************************************************
 * Global/Static Variables
 ******************************************************************/
uint16_t connection_id;

uint8_t ledValue; // Current value of the LED characteristic

/* Enable RTOS aware debugging in OpenOCD */
volatile int uxTopUsedPriority;

/*UART task and Queue handles */
TaskHandle_t UartTaskHandle = NULL;
QueueHandle_t xUARTQueue = 0;

/* Start/end handles for service group */
static const uint8_t serviceUUID[] = {__UUID_SERVICE_PSOC};
static uint16_t serviceStartHandle = 0x0001;
static uint16_t serviceEndHandle = 0xFFFF;

/* Structure to hold handles of discovered characteristics: */
typedef struct
{
  uint16_t startHandle;
  uint16_t endHandle;
  uint16_t valHandle;
  uint16_t cccdHandle;
} charHandle_t;

/* Start/end handles for each characteristic group */
static const uint8_t ledUUID[] = {__UUID_CHARACTERISTIC_PSOC_LED};
static charHandle_t ledChar;
static const uint8_t counterUUID[] = {__UUID_CHARACTERISTIC_PSOC_BUTTON_COUNT};
static charHandle_t counterChar;

/* Array of characteristic group handles to hold values temporarily as they are discovered */
#define MAX_CHARS_DISCOVERED (10)
static charHandle_t charHandles[MAX_CHARS_DISCOVERED];
static uint32_t charHandleCount;

/*******************************************************************
 * Function Implementations
 ******************************************************************/
/*******************************************************************************
 * Function Name: wiced_bt_dev_status_t app_bt_management_callback(
 * 					wiced_bt_management_evt_t event,
 * 					wiced_bt_management_evt_data_t *p_event_data )
 ********************************************************************************/
static wiced_result_t app_bt_management_callback(wiced_bt_management_evt_t event, wiced_bt_management_evt_data_t *p_event_data)
{
  /* Start in error state so that any unimplemented states will return error */
  wiced_result_t result = WICED_BT_ERROR;
  wiced_bt_device_address_t bda = {0};

  printf("Bluetooth Management Event: 0x%x %s\n", event, get_bt_event_name(event));

  switch (event)
  {
  case BTM_ENABLED_EVT: // Bluetooth Controller and Host Stack Enabled
    if (WICED_BT_SUCCESS == p_event_data->enabled.status)
    {
      printf("Bluetooth Enabled\n");

      /* Set the local BDA from the value in the configurator and print it */
      wiced_bt_set_local_bdaddr((uint8_t *)cy_bt_device_address, BLE_ADDR_PUBLIC);
      wiced_bt_dev_read_local_addr(bda);
      printf("Local Bluetooth Device Address: ");
      print_bd_address(bda);

      /* Register GATT callback */
      wiced_bt_gatt_register(app_bt_gatt_event_callback);

#if (UART_INPUT == true)
      /* Setup UART user input interface now that the stack is running */
      xUARTQueue = xQueueCreate(10, sizeof(uint8_t));
      cyhal_uart_register_callback(&cy_retarget_io_uart_obj, rx_cback, NULL);                    /* Register UART Rx callback */
      cyhal_uart_enable_event(&cy_retarget_io_uart_obj, CYHAL_UART_IRQ_RX_NOT_EMPTY, 3, TRUE);   /* Enable Rx interrupt */
      xTaskCreate(uart_task, "UartTask", TASK_STACK_SIZE, NULL, TASK_PRIORITY, &UartTaskHandle); /* Start task */
      uint8_t helpCommand = '?';
      xQueueSend(xUARTQueue, &helpCommand, 0); /* Print out list of commands */
#endif

