TA222301017/DualCore_BLE_SD_PSOC6/proj_cm0p/Local/BLETask.h
      result = WICED_BT_SUCCESS;
    }
    else
    {
      printf("Failed to initialize Bluetooth controller and stack\n");
    }
    break;

  case BTM_PAIRING_IO_CAPABILITIES_BLE_REQUEST_EVT:
    p_event_data->pairing_io_capabilities_ble_request.auth_req = BTM_LE_AUTH_REQ_SC_MITM_BOND;
    p_event_data->pairing_io_capabilities_ble_request.init_keys = BTM_LE_KEY_PENC | BTM_LE_KEY_PID;
    p_event_data->pairing_io_capabilities_ble_request.local_io_cap = BTM_IO_CAPABILITIES_NONE;
    p_event_data->pairing_io_capabilities_ble_request.max_key_size = 0x10;
    p_event_data->pairing_io_capabilities_ble_request.resp_keys = BTM_LE_KEY_PENC | BTM_LE_KEY_PID;
    p_event_data->pairing_io_capabilities_ble_request.oob_data = BTM_OOB_NONE;
    result = WICED_BT_SUCCESS;
    break;

  case BTM_PAIRING_COMPLETE_EVT:
    printf("Pairing complete: %d\n", p_event_data->pairing_complete.pairing_complete_info.ble.status);
    result = WICED_BT_SUCCESS;
    break;

  case BTM_ENCRYPTION_STATUS_EVT:
    printf("Encrypt status: %d\n", p_event_data->encryption_status.result);
    result = WICED_BT_SUCCESS;
    break;

  case BTM_PAIRED_DEVICE_LINK_KEYS_UPDATE_EVT:
    result = WICED_BT_SUCCESS;
    break;

  case BTM_PAIRED_DEVICE_LINK_KEYS_REQUEST_EVT:
    result = WICED_BT_ERROR; // Return error since keys are not stored in EEPROM
    break;

  case BTM_LOCAL_IDENTITY_KEYS_UPDATE_EVT: // Save keys to NVRAM
    result = WICED_BT_SUCCESS;
    break;

  case BTM_LOCAL_IDENTITY_KEYS_REQUEST_EVT: // Read keys from NVRAM
                                            /* This should return WICED_BT_SUCCESS if not using privacy. If RPA is enabled but keys are not
                                               stored in EEPROM, this must return WICED_BT_ERROR so that the stack will generate new privacy keys */
    result = WICED_BT_ERROR;
    break;

  case BTM_BLE_SCAN_STATE_CHANGED_EVT: // Scan State Change
    switch (p_event_data->ble_scan_state_changed)
    {
    case BTM_BLE_SCAN_TYPE_NONE:
      printf("Scanning stopped.\r\n");
      cyhal_gpio_write(CYBSP_USER_LED2, CYBSP_LED_STATE_OFF);
      break;

    case BTM_BLE_SCAN_TYPE_HIGH_DUTY:
      printf("High duty scanning.\r\n");
      cyhal_gpio_write(CYBSP_USER_LED2, CYBSP_LED_STATE_ON);
      break;

    case BTM_BLE_SCAN_TYPE_LOW_DUTY:
      printf("Low duty scanning.\r\n");
      cyhal_gpio_write(CYBSP_USER_LED2, CYBSP_LED_STATE_ON);
      break;
    }
    result = WICED_BT_SUCCESS;
    break;

  case BTM_BLE_CONNECTION_PARAM_UPDATE:
    result = WICED_BT_SUCCESS;
    break;

  default:
    break;
  }

  return result;
}

/*******************************************************************************
 * Function Name: wiced_bt_gatt_status_t app_bt_gatt_event_callback(
 * 					wiced_bt_gatt_evt_t event,
 * 					wiced_bt_gatt_event_data_t *p_data )
 ********************************************************************************/
static wiced_bt_gatt_status_t app_bt_gatt_event_callback(wiced_bt_gatt_evt_t event, wiced_bt_gatt_event_data_t *p_event_data)
{
  /* Start in error state so that any unimplemented states will return error */
  wiced_bt_gatt_status_t status = WICED_BT_GATT_ERROR;

  /* Call the appropriate callback function based on the GATT event type, and pass the relevant event
   * parameters to the callback function */
  switch (event)
  {
  case GATT_CONNECTION_STATUS_EVT:
    status = app_bt_connect_event_handler(&p_event_data->connection_status);
    break;

  case GATT_OPERATION_CPLT_EVT:
    /* Look for any type of successful GATT completion */
    if (p_event_data->operation_complete.status == WICED_BT_GATT_SUCCESS ||
        p_event_data->operation_complete.status == WICED_BT_GATT_ENCRYPTED_MITM ||
        p_event_data->operation_complete.status == WICED_BT_GATT_ENCRYPTED_NO_MITM ||
        p_event_data->operation_complete.status == WICED_BT_GATT_NOT_ENCRYPTED)
    {
      printf("GATT operation completed successfully\n");
      status = WICED_BT_GATT_SUCCESS;
      if (p_event_data->operation_complete.op == GATTC_OPTYPE_READ_HANDLE)
      {
        if (p_event_data->operation_complete.response_data.handle == ledChar.valHandle)
        {
          printf("LED value is: %d\n", ledValue);
        }
      }
      else if (p_event_data->operation_complete.op == GATTC_OPTYPE_NOTIFICATION)
      {
        if (p_event_data->operation_complete.response_data.handle == counterChar.valHandle)
        {
          printf("Count notification received: %d\n", *p_event_data->operation_complete.response_data.att_value.p_data);
        }
      }
    }
    else
    {
      printf("GATT operation failed with status: %d\n", p_event_data->operation_complete.status);
    }
    break;

  case GATT_GET_RESPONSE_BUFFER_EVT: /* GATT buffer request, typically sized to max of bearer mtu - 1 */
    p_event_data->buffer_request.buffer.p_app_rsp_buffer = app_bt_alloc_buffer(p_event_data->buffer_request.len_requested);
    p_event_data->buffer_request.buffer.p_app_ctxt = (void *)app_bt_free_buffer;
    status = WICED_BT_GATT_SUCCESS;
    break;

  case GATT_APP_BUFFER_TRANSMITTED_EVT: /* GATT buffer transmitted event,  check \ref wiced_bt_gatt_buffer_transmitted_t*/
  {
    pfn_free_buffer_t pfn_free = (pfn_free_buffer_t)p_event_data->buffer_xmitted.p_app_ctxt;

    /* If the buffer is dynamic, the context will point to a function to free it. */
    if (pfn_free)
    {
      pfn_free(p_event_data->buffer_xmitted.p_app_data);
    }
    status = WICED_BT_GATT_SUCCESS;
  }
  break;

  case GATT_DISCOVERY_RESULT_EVT:
    //////////////// Services Discovery /////////////////
    if (p_event_data->discovery_result.discovery_type == GATT_DISCOVER_SERVICES_BY_UUID)
    {
      serviceStartHandle = p_event_data->discovery_result.discovery_data.group_value.s_handle;
      serviceEndHandle = p_event_data->discovery_result.discovery_data.group_value.e_handle;
      printf("Discovered Service Start=0x%04X End=0x%04X\r\n", serviceStartHandle, serviceEndHandle);
    }

    //////////////// Characteristics Discovery /////////////////
    if (p_event_data->discovery_result.discovery_type == GATT_DISCOVER_CHARACTERISTICS)
    {
      charHandles[charHandleCount].startHandle = p_event_data->discovery_result.discovery_data.characteristic_declaration.handle;
      charHandles[charHandleCount].valHandle = p_event_data->discovery_result.discovery_data.characteristic_declaration.val_handle;
      charHandles[charHandleCount].endHandle = serviceEndHandle; /* Assume this is the last characteristic in the service so its end handle is at the end of the service group */

      printf("Char Handle=0x%04X Value Handle=0x%04X ", charHandles[charHandleCount].startHandle, charHandles[charHandleCount].valHandle);

      if (charHandleCount != 0) /* If this isn't the first characteristic found, we need to reset the end handle of the previous characteristic */
      {
        charHandles[charHandleCount - 1].endHandle = charHandles[charHandleCount].startHandle - 1;
      }
      charHandleCount += 1;

      if (charHandleCount > MAX_CHARS_DISCOVERED - 1)
      {
        printf("This is really bad.. we discovered more characteristics than we can save\r\n");
      }

      /* Look only for 16 byte UUIDs */
      if (p_event_data->discovery_result.discovery_data.characteristic_declaration.char_uuid.len == LEN_UUID_128)
      {
        if (memcmp(ledUUID, p_event_data->discovery_result.discovery_data.characteristic_declaration.char_uuid.uu.uuid128, LEN_UUID_128) == 0) // If it is the LED characteristic
        {
          ledChar.startHandle = p_event_data->discovery_result.discovery_data.characteristic_declaration.handle;
          ledChar.valHandle = p_event_data->discovery_result.discovery_data.characteristic_declaration.val_handle;
        }

