TA222301017/DualCore_BLE_SD_PSOC6/proj_cm0p/Local/BLETask.h
        if (memcmp(counterUUID, p_event_data->discovery_result.discovery_data.characteristic_declaration.char_uuid.uu.uuid128, LEN_UUID_128) == 0) // If it is the button count characteristic
        {
          counterChar.startHandle = p_event_data->discovery_result.discovery_data.characteristic_declaration.handle;
          counterChar.valHandle = p_event_data->discovery_result.discovery_data.characteristic_declaration.val_handle;
        }

        printf("UUUD: ");
        for (int i = 0; i < p_event_data->discovery_result.discovery_data.characteristic_declaration.char_uuid.len; i++) // Dump the UUID bytes to the screen
        {
          printf("%02X ", p_event_data->discovery_result.discovery_data.characteristic_declaration.char_uuid.uu.uuid128[i]);
        }
      }
      printf("\r\n");
    }

    //////////////// Descriptors Discovery /////////////////
    if (p_event_data->discovery_result.discovery_type == GATT_DISCOVER_CHARACTERISTIC_DESCRIPTORS)
    {
      if (p_event_data->discovery_result.discovery_data.char_descr_info.type.uu.uuid16 == __UUID_DESCRIPTOR_CLIENT_CHARACTERISTIC_CONFIGURATION)
      {
        counterChar.cccdHandle = p_event_data->discovery_result.discovery_data.char_descr_info.handle;

        /* Print out the handle and UUID of the CCCD */
        printf("Char Descriptor Handle = 0x%04X, UUID: ", p_event_data->discovery_result.discovery_data.char_descr_info.handle);

        for (int i = 0; i < p_event_data->discovery_result.discovery_data.char_descr_info.type.len; i++)
        {
          /* We will use the uuid128 value from the union and just print out as many bytes as the len parameter
           * indicates. This allows us to print any type of UUID */
          printf("%02X ", p_event_data->discovery_result.discovery_data.char_descr_info.type.uu.uuid128[i]);
        }
        printf("\r\n");
      }
    }
    break;

  case GATT_DISCOVERY_CPLT_EVT:
    /* Once all characteristics are discovered... you need to setup the end handles */
    if (p_event_data->discovery_complete.discovery_type == GATT_DISCOVER_CHARACTERISTICS)
    {
      for (int i = 0; i < charHandleCount; i++)
      {
        if (charHandles[i].startHandle == ledChar.startHandle)
          ledChar.endHandle = charHandles[i].endHandle;
        if (charHandles[i].startHandle == counterChar.startHandle)
          counterChar.endHandle = charHandles[i].endHandle;
      }
    }

    break;

  default:
    printf("Unhandled GATT Event: 0x%x (%d)\n", event, event);
    status = WICED_BT_GATT_SUCCESS;
    break;
  }

  return status;
}

/*******************************************************************************
 * Function Name: app_bt_connect_event_handler
 *
 * Handles GATT connection status changes.
 *
 * Param:	p_conn_status  Pointer to data that has connection details
 * Return:	wiced_bt_gatt_status_t
 * See possible status codes in wiced_bt_gatt_status_e in wiced_bt_gatt.h
 *******************************************************************************/
static wiced_bt_gatt_status_t app_bt_connect_event_handler(wiced_bt_gatt_connection_status_t *p_conn_status)
{
  wiced_bt_gatt_status_t status = WICED_BT_GATT_ERROR;

  if (NULL != p_conn_status)
  {
    if (p_conn_status->connected)
    {
      /* Handle the connection */
      printf("GATT_CONNECTION_STATUS_EVT: Connect BDA ");
      print_bd_address(p_conn_status->bd_addr);
      printf("Connection ID %d\n", p_conn_status->conn_id);

      connection_id = p_conn_status->conn_id;

      cyhal_gpio_write(CYBSP_USER_LED2, CYBSP_LED_STATE_ON);

      /* Initiate pairing */
      wiced_bt_dev_sec_bond(p_conn_status->bd_addr, p_conn_status->addr_type, BT_TRANSPORT_LE, 0, NULL);
    }
    else
    {
      /* Handle the disconnection */
      printf("Disconnected : BDA ");
      print_bd_address(p_conn_status->bd_addr);
      printf("Connection ID '%d', Reason '%s'\n", p_conn_status->conn_id, get_bt_gatt_disconn_reason_name(p_conn_status->reason));

      connection_id = 0;

      cyhal_gpio_write(CYBSP_USER_LED2, CYBSP_LED_STATE_OFF);
    }

    status = WICED_BT_GATT_SUCCESS;
  }

  return status;
}

/*******************************************************************************
 * Function Name: void scanCallback(
 * 					wiced_bt_ble_scan_results_t *p_scan_result,
 * 					uint8_t *p_adv_data )
 ********************************************************************************/
void scanCallback(wiced_bt_ble_scan_results_t *p_scan_result, uint8_t *p_adv_data)
{
#define MAX_ADV_NAME_LEN (28)        /* Maximum possible name length since flags take 3 bytes and max packet is 31. */
#define SEARCH_DEVICE_NAME "key_per" /* Name of device to search for */

  uint8_t len;
  uint8_t *p_name = NULL;

  uint8_t dev_name[MAX_ADV_NAME_LEN];

  p_name = wiced_bt_ble_check_advertising_data(p_adv_data, BTM_BLE_ADVERT_TYPE_NAME_COMPLETE, &len);

  if (p_name && (len == strlen(SEARCH_DEVICE_NAME)) && (memcmp(SEARCH_DEVICE_NAME, p_name, len) == 0))
  {
    memcpy(dev_name, p_name, len);
    dev_name[len] = 0x00; /* Null terminate the string */

    printf("Found Device \"%s\" with BD Address: ", dev_name);
    print_bd_address(p_scan_result->remote_bd_addr);

    /* Connect to peripheral and stop scanning*/
    wiced_bt_gatt_le_connect(p_scan_result->remote_bd_addr, p_scan_result->ble_addr_type, BLE_CONN_MODE_HIGH_DUTY, WICED_TRUE);
    wiced_bt_ble_scan(BTM_BLE_SCAN_TYPE_NONE, WICED_TRUE, scanCallback);
  }
}

/*******************************************************************************
 * Function Name: void writeAttribute
 ********************************************************************************/
void writeAttribute(uint16_t conn_id, uint16_t handle, uint16_t offset, wiced_bt_gatt_auth_req_t auth_req, uint16_t len, uint8_t *val)
{
  if (conn_id && handle) /* Only write if we have a connection and the handle is defined */
  {
    /* Set up write parameters */
    wiced_bt_gatt_write_hdr_t write_params;
    write_params.handle = handle;
    write_params.offset = offset;
    write_params.len = len;
    write_params.auth_req = auth_req;

    /* Send the write command */
    wiced_bt_gatt_client_send_write(connection_id, GATT_REQ_WRITE, &write_params, val, NULL);
  }
}

