TA222301017/DualCore_BLE_SD_PSOC6/proj_cm0p/Local/BLETask.h
/*******************************************************************************
 * Function Name: startServiceDiscovery
 ********************************************************************************/
static void startServiceDiscovery(void)
{
  wiced_bt_gatt_discovery_param_t discovery_param;
  memset(&discovery_param, 0, sizeof(discovery_param));
  discovery_param.s_handle = 0x0001;
  discovery_param.e_handle = 0xFFFF;
  discovery_param.uuid.len = LEN_UUID_128;
  memcpy(&discovery_param.uuid.uu.uuid128, serviceUUID, LEN_UUID_128);

  wiced_bt_gatt_status_t status = wiced_bt_gatt_client_send_discover(connection_id, GATT_DISCOVER_SERVICES_BY_UUID, &discovery_param);
  printf("Started service discovery. Status: 0x%02X\r\n", status);
}

/*******************************************************************************
 * Function Name: startCharacteristicDiscovery
 ********************************************************************************/
static void startCharacteristicDiscovery(void)
{
  charHandleCount = 0;

  wiced_bt_gatt_discovery_param_t discovery_param;
  memset(&discovery_param, 0, sizeof(discovery_param));
  discovery_param.s_handle = serviceStartHandle + 1;
  discovery_param.e_handle = serviceEndHandle;

  wiced_bt_gatt_status_t status = wiced_bt_gatt_client_send_discover(connection_id, GATT_DISCOVER_CHARACTERISTICS, &discovery_param);
  printf("Started characteristic discover. Status: 0x%02X\r\n", status);
}

/*******************************************************************************
 * Function Name: startDescriptorDiscovery
 ********************************************************************************/
static void startDescriptorDiscovery(void)
{
  printf("Button Count Start Handle = 0x%04X End Handle=0x%04X\r\n", counterChar.startHandle, counterChar.endHandle);

  wiced_bt_gatt_discovery_param_t discovery_param;
  memset(&discovery_param, 0, sizeof(discovery_param));
  discovery_param.s_handle = counterChar.valHandle + 1; /* Use value handle plus 1 since the CCCD must be later in the group */
  discovery_param.e_handle = counterChar.endHandle;

  wiced_bt_gatt_status_t status = wiced_bt_gatt_client_send_discover(connection_id, GATT_DISCOVER_CHARACTERISTIC_DESCRIPTORS, &discovery_param);
  printf("Start char descriptor discovery. Status: 0x%02X\r\n", status);
}

#if (UART_INPUT == true)
/*******************************************************************************
 * Function Name: uart_task()
 ********************************************************************************
 *
 * Summary:
 *   This function runs the UART task which processes the received commands via
 *   Terminal.
 *
 * Parameters:
 *   void *pvParameters                 Not used
 *
 * Return:
 *   None
 *
 *******************************************************************************/
static void uart_task(void *pvParameters)
{
  uint8_t readbyte;
  for (;;)
  {
    /* Wait for a character to be sent from the UART ISR */
    if (pdPASS == xQueueReceive(xUARTQueue, &(readbyte), portMAX_DELAY))
    {
      switch (readbyte)
      {
      case 's': // Turn on scanning
        wiced_bt_ble_scan(BTM_BLE_SCAN_TYPE_HIGH_DUTY, WICED_TRUE, scanCallback);
        break;

      case 'S': // Turn off scanning
        wiced_bt_ble_scan(BTM_BLE_SCAN_TYPE_NONE, WICED_TRUE, scanCallback);
        break;

      case 'd': // Disconnect
        wiced_bt_gatt_disconnect(connection_id);
        break;

      case 'n': // Turn notifications on
      {
        uint8_t writeData[2] = {0};
        writeData[0] = GATT_CLIENT_CONFIG_NOTIFICATION; /* Values are sent little endian */
        writeAttribute(connection_id, counterChar.cccdHandle, 0, GATT_AUTH_REQ_NO_MITM, sizeof(uint16_t), writeData);
      }
      break;

      case 'N': // Turn notifications off
      {
        uint8_t writeData[2] = {0};
        writeData[0] = GATT_CLIENT_CONFIG_NONE; /* Values are sent little endian */
        writeAttribute(connection_id, counterChar.cccdHandle, 0, GATT_AUTH_REQ_NO_MITM, sizeof(uint16_t), writeData);
      }
      break;

      case '0': // LEDs off
      case '1': // LEDs blue
      case '2': // LEDs red
      case '3': // LEDs blue+red
      case '4': // LEDs green
      case '5': // LEDs blue+green
      case '6': // LEDs red+green
      case '7': // LEDs white
      {
        uint8_t writeData[1];
        writeData[0] = readbyte - '0';
        writeAttribute(connection_id, ledChar.valHandle, 0, GATT_AUTH_REQ_NONE, sizeof(uint8_t), writeData);
      }
      break;

      case 'r': // Read LED value
        wiced_bt_gatt_client_send_read_handle(connection_id, ledChar.valHandle, 0, &ledValue, sizeof(ledValue), GATT_AUTH_REQ_NONE);
        break;

      case 'q': // Start service discovery
        startServiceDiscovery();
        break;

      case 'w': // Start characteristic discovery
        startCharacteristicDiscovery();
        break;

      case 'e': // Start descriptor discovery
        startDescriptorDiscovery();
        break;

      default:
        printf("Unrecognized command\r\n");
        /* No break - fall through and display help */

      case '?': // Help
        printf("Commands:\r\n");
        printf("\t%c\tHelp (this message)\r\n", '?');
        printf("\t%c\tStart scanning and connect\r\n", 's');
        printf("\t%c\tStop scanning\r\n", 'S');
        printf("\t%c\tDisconnect\r\n", 'd');
        printf("\t%c\tTurn on Button Count notifications\r\n", 'n');
        printf("\t%c\tTurn off Button Count notifications\r\n", 'N');
        printf("\t%s\tControl LED\r\n", "0...7");
        printf("\t%c\tRead LED value\r\n", 'r');
        printf("\t%c\tStart service discovery\r\n", 'q');
        printf("\t%c\tStart characteristic discovery\r\n", 'w');
        printf("\t%c\tStart descriptor discovery\r\n", 'e');

        printf("\r\n");
        break;
      }
    }
  }
}

/*******************************************************************************
 * Function Name: rx_cback()
 ********************************************************************************
 *
 * Summary:
 *   This function gets a character from the UART and sends it to the UART
 *   task for processing
 *
 * Parameters:
 *   void *handler_arg:                 Not used
 *   cyhal_uart_event_t event:          Not used
 *
 * Return:
 *   None
 *
 *******************************************************************************/
void rx_cback(void *handler_arg, cyhal_uart_event_t event)
{
  (void)handler_arg;
  uint8_t readbyte;
  cy_rslt_t status;
  BaseType_t xYieldRequired = pdFALSE;

  /* Read one byte from the buffer with a 1ms timeout */
  status = cyhal_uart_getc(&cy_retarget_io_uart_obj, &readbyte, 1);

  /* If a character was received, send it to the UART task */
  if (CY_RSLT_SUCCESS == status)
  {
    xQueueSendFromISR(xUARTQueue, &readbyte, &xYieldRequired);
  }

  /* Yield current task if a higher priority task is now unblocked */
  portYIELD_FROM_ISR(xYieldRequired);
}
#endif

/*******************************************************************************
 * Function Name: app_bt_alloc_buffer
 *
 * This Function allocates the buffer of requested length
 *
 * Param:  len			Length of buffer
 * Return: uint8_t*      Pointer to allocated buffer
 ********************************************************************************/
static uint8_t *app_bt_alloc_buffer(uint16_t len)
{
  uint8_t *p = (uint8_t *)malloc(len);
  return p;
}

/*******************************************************************************
 * Function Name: app_bt_free_buffer
 *
 * This Function frees the buffer requested
 *
 * Param:  p_data		Pointer to buffer to be freed
 ********************************************************************************/
static void app_bt_free_buffer(uint8_t *p_data)
{
  if (p_data != NULL)
  {
    free(p_data);
  }
}

#endif /* BLETASK_H_ */
